backend/modules/v1/controllers/ProdutoController.php

    public function actionFiltrar()
    {
        Yii::$app->response->format = Response::FORMAT_JSON;

        $params = Yii::$app->request->bodyParams;

        $query = Produto::find();

        if (!empty($params['nome'])) {
            $query->andWhere(['like', 'nome', $params['nome']]);
        }

        if (!empty($params['categoriaId'])) {
            $query->andWhere(['categoriaId' => $params['categoriaId']]);
        }

        if (!empty($params['quantidadeInicial'])) {
            $query->andWhere(['>=', 'quantidade', $params['quantidadeInicial']]);
        }

        if (!empty($params['quantidadeFinal'])) {
            $query->andWhere(['<=', 'quantidade', $params['quantidadeFinal']]);
        }

         $produtos = $query->all();
---
SELECT * FROM `produto` WHERE (`nome` LIKE '%Corrida%') AND (`quantidade` >= 2)